<template>
  <div class="line">
    <div class="example">
      <div class="label">demo1：无省略效果</div>
      <div>
        测试文字测试文字测试文字测试文字测试文字测试文字测试文字测试文字测试文字测试文字测试文字
        测试文字测试文字测试文字测试文字测试文字测试文字测试文字测试文字测试文字测试文字测试文字
        测试文字测试文字测试文字测试文字测试文字测试文字测试文字测试文字测试文字测试文字测试文字
        测试文字测试文字测试文字测试文字测试文字测试文字测试文字测试文字测试文字测试文字测试文字
        测试文字测试文字测试文字测试文字测试文字测试文字测试文字测试文字
      </div>
    </div>

    <div class="example">
      <div class="label">demo2：超出一行省略，hover上去显示title</div>
      <div v-lines="{ 'line': 1, 'showTitle': true }">
        测试文字测试文字测试文字测试文字测试文字测试文字测试文字测试文字测试文字测试文字测试文字
        测试文字测试文字测试文字测试文字测试文字测试文字测试文字测试文字测试文字测试文字测试文字
        测试文字测试文字测试文字测试文字测试文字测试文字测试文字测试文字测试文字测试文字测试文字
        测试文字测试文字测试文字测试文字测试文字测试文字测试文字测试文字测试文字测试文字测试文字
        测试文字测试文字测试文字测试文字测试文字测试文字测试文字测试文字
      </div>
    </div>

    <div class="example">
      <div class="label">demo3：超出两行省略</div>
      <div v-lines="{ 'line': 2 }">
        测试文字测试文字测试文字测试文字测试文字测试文字测试文字测试文字测试文字测试文字测试文字
        测试文字测试文字测试文字测试文字测试文字测试文字测试文字测试文字测试文字测试文字测试文字
        测试文字测试文字测试文字测试文字测试文字测试文字测试文字测试文字测试文字测试文字测试文字
        测试文字测试文字测试文字测试文字测试文字测试文字测试文字测试文字测试文字测试文字测试文字
        测试文字测试文字测试文字测试文字测试文字测试文字测试文字测试文字
      </div>
    </div>

    <div class="example">
      <div class="label">demo4：超出三行省略，省略号右侧留白10个字符串</div>
      <div v-lines="{ 'line': 3, 'rightBlank': 10 }">
        我和我的祖国一刻也不能分割无论我走到哪里都流出一首赞歌我歌唱每一座高山我歌唱每一条河
        袅袅炊烟小小村落路上一道辙你用你那母亲的脉搏和我诉说我的祖国和我像海和浪花一朵浪是海的
        赤子海是那浪的依托每当大海在微笑我就是笑的旋涡我分担着海的忧愁分享海的欢乐永远给我碧浪
        清波心中的歌啦啦
      </div>
    </div>
  </div>
</template>

<script>

export default {
  name: 'Lines',

  data() {
    return {
      name: 'name',
    };
  },
};
</script>

<style scoped lang="less">
.line {
  width: 500px;
  line-height: 20px;

  .example {
    margin-bottom: 20px;
  }
  .label {
    margin-bottom: 16px;
    font-weight: bold;
  }
}
</style>
